#include <vector>
#include <string>

using namespace std;

int load1 = -1;
int load2 = -1;
int load3 = -1;
int load4 = -1;
int load5 = -1;
int load6 = -1;
int load7 = -1;
int load8 = -1;

int musicid = 0;
float musicvalue = 1.0;

int voiceid = 0;
float voicevalue = 1.0;

int RecordFrom = 0;

int HaveFigure = 0;

int HaveTxts = 0;

int HaveS = 0;

int HaveK = 0;

int HaveMenu = 0;

bool levelOfCard = true;

int CARDmusicid = 0;

vector<string> recordBackGround = {
	"GameLook/1.png","GameLook/2.png","GameLook/3.png","GameLook/4.png","GameLook/4.png","N","N","K","N","N","N",
	"N","N","N","N","N","N","N","N","N","N",
	"N","N","N","N","N","N","N","N","N","N",
	"GameLook/5.png","N","GameLook/6.png","N","N","N","N","N","N",	"N",
	"N","N","N","N","N","N","N","N","GameLook/7.png","N",
	"N","N","N","GameLook/8.png","N","N","N","N","N","N",
	"N","GameLook/9.png","N","N","N","N","N","N","N","N",
	"N","END"
};

vector<string> recordBGM = {
	"InGame/gamestart.mp3","N","N","N","N","N","N","N","N","N","N"	,
	"N","N","N","N","N","N","N","N","N","N",
	"N","N","N","N","N","N","N","N","N","N",
	"N","N","InGame/meetmylove.mp3","N","N","N","N","N","N","N",
	"N","N","N","N","N","N","N","N","N","N",
	"N","N","N","N","N","N","N","N","N","N",
	"N","N","N","N","N","N","N","N","N","N",
	"N"
};

vector<string> recordFigure = {
	"N","GameLook/jieCheng.png","N","GameLook/jieCheng.png","N","GameLook/jieCheng.png","GameLook/longtao.png","GameLook/longtao.png","GameLook/jieCheng.png","N","N",
	"N","N","N","N","N","N","N","N","N","N",
	"N","N","N","N","N","N","N","N","N","N",
	"N","N","N","N","N","N","N","N","N","N",
	"N","N","N","N","N","N","N","N","N","N",
	"N","N","N","N","N","N","N","N","N","N",
	"N","N","N","N","GameLook/jieCheng.png","N","N","N","N","N",
	"N"
};

vector<string> recordVoice(72, "N");


vector<string> recordTxt = {
	u8"平凡的世界中，人与人之间只需要一直不停的相遇，或许就会触发各种各样的故事。",
	u8"在这所普通的高中，我获得了人生中最难忘的的相遇?",
	u8"一切，都是从这一天开始...",
	u8"结城：（思考中）",
	u8"健人： 呐，智博，干什么呢？午餐时间把便当放在桌上不吃，	要我帮你吃掉吗？",
	u8"结城： 在贫瘠荒芜的平原中，主人公拥有的最后生存希望，就	是这最后的便当。",
	u8"健人： 又在想些人类无法理解的剧情吗，高中生漫画家？",
	u8"野生的健人出现了！要做些什么呢？",
	u8"健人： 让我看看，今天的便当里面都装了些什么呢...",
	u8"结城： 便当是最后的希望，然而就在主人公面临着饥饿的危机	时刻，身旁却有着一只狠狠地盯着便当的饿狼...",
	u8"健人的手渐渐伸向便当..." ,
	u8"结城： 这时候，饿狼的利爪伸向便当。",
	u8"健人： 你一个人自言自语什么呢？到底让不让我吃啊？",
	u8"结城： 然而，主人公并没有选择使用手中的武器打倒饿狼，而	是选择了用爱与和平解决这场生与死的冲突！",
	u8"健人： 哈??又开始了?",
	u8"健人： 又犯中二病了，真是无力吐槽。",
	u8"结城： 来吧，饿狼，请吃下我最后的便当，我不和你打架，只	会用武力对抗敌人，这种事情是我不愿意做的！",u8"结城： 让伟大的	我用爱与和平拯救你的生命吧！我一定能做到的！来吧，吃下它！",
	u8"健人： 哦...哦...既然你叫我吃，那我就不客气了...我开动	啦！",
	u8"看到健人伸出手来的我一把抢回了自己的便当。",
	u8"健人： 喂！你到底让不让人好好吃饭！",
	u8"结城： 就在这时，奇迹发生了！原来主人公身边的饿狼是神给	予主人公的试炼！用来考验他是否是真正拥有爱心与奉献之心的勇者！	",
	u8"结城： 饿狼最后化身成为神的使者，赐予了主人公强大的力量	，由此，主人公被爱拯救了，世界被爱拯救了，地球被爱拯救了！！！	",
	u8"健人： 我好饿啊，我说，最后那个便当到底是吃还是不吃？",
	u8"结城： 那些都不重要",
	u8"健人： 但是我的肚子认为这个很重要！",
	u8"结城： 刚才的一段儿你觉得怎么样？是不是很震撼？画成漫画	的话是不是有一种让人热血沸腾的感觉 ? ",
	u8"健人： 抱歉...没有在听...也不是，是听了之后完全不明所以	。果然漫画家脑袋里面想的事情不是我这种普通人能理解的呢...呵呵	呵...",
	u8"结城： 这样...啊...",
	u8"我满怀信心地说出自己想的点子，但是见健人好像完全不感兴	趣，感觉很失落。",
	u8"看到结城失落，健人想马上聊些别的话题缓和一下气氛，他不	经意间看了看教室的窗外。",
	u8"健人： 智博！快看窗外！在校门口的那个人！",
	u8"我被健人的声音吸引，也走到窗边，向校门口望去。",
	"N",
	u8"结城： 那个人是??",
	u8"健人： 她是青鸟琉璃学姐啊，三年三班的女神，是全校男生憧	憬的对象。每天都是中午的时候就早退离开学校，而且上学和早退次次	都有保镖和豪车来接送，因为这个青鸟学姐在学校很有名呢...",
	u8"结城： 任性富二代，白富美?就是那种不知道哪里的大小姐类	型的人吧 ? 反正和我们这种庶民一点儿关系都没有。",
	u8"健人： 虽然和学姐没什么交流，不过其实在我看来青鸟学姐和	智博还是有些共同点的。",
	u8"智博： 那是什么意思？",
	u8"健人： 两个人都是那种让人难以理解的类型，不过与其说是难	以理解，青鸟学姐应该说是神秘比较恰当吧 ? ",
	u8"结城： 哦??",
	u8"面对健人津津乐道的漂亮学姐的话题，其实我毫不在意?",
	u8"健人： 很多男生都向青鸟学姐告过白，不过最后都无一例外地	失败了...不愧是大小姐而且是那么漂亮的美人呢!",
	u8"健人： 别说是男生，学姐就算是女生也很少接触...不过就是	因为这份神秘感才让人喜欢得欲罢不能呢!",
	u8"健人： 不过对这些，智博你可能完全不感兴趣吧...毕竟你的	脑袋里成天想的东西只有漫画...",
	u8"结城： 当然了，我这个周刊连载的漫画家每星期都有截稿日期	，哪有闲心去关心女生的事情啊。",
	u8"结城： 再说，那种大小姐完全就是高枝之花，大概一辈子都不	可能和我们说上一句话吧。还是早点儿放弃梦想关注现实吧。",
	u8"健人： 我可不想被一个成天根本不在大脑里思考现实的人教训	...",
	u8"想着自己的截稿日期，在清闲的上课中我偷偷在下面思考着漫	画的分镜，这样一上午就过去了。",
	u8"叮..........",
	u8"又上了一下午的课，现在到了放学时间。我开始收拾书包，这	时已经收拾完书包的健人走过来打招呼。",
	u8"健人： 真羡慕没有参加社团的家伙啊，放学就可以收拾书包回	家了。",
	u8"结城： 哪有那么清闲，你也知道的吧，我得整理些材料然后回	家工作...明天是周六，今天还得熬夜。",
	u8"健人： 果然，还是画画?那么我有社团活动，就先走了。下星	期见。",
	u8"结城： 啊，那么，下星期见！",
	u8"说起来我也该快点去鞋柜那里去换鞋回家了呢",
	u8"结城： 哎...健人那家伙，跟他说了那么完美的漫画点子，他	竟然说完全不明所以...我的点子真的就那么难以理解吗？",
	u8"结城： 的确，不能让读者理解我的点子的话，漫画的人气会越	来越差...这大概就是漫画家不得不背负的寂寞与孤独吧... ",
	u8"我是一个平凡的高中生，但是和别人不一样的是，现在的我也	是一名职业的漫画家。",
	u8"从小时候开始，成为漫画家就是我的梦想。让更多的人通过漫	画的形式理解我创造的故事是我最大的希望。",
	u8"不过，虽然半年前在一家小有名气的书店的周刊杂志上连载了	第一部漫画，不过才画了五话就被迫烂尾完结了，原因是编辑说读者没	法理解漫画的剧情...",
	u8"哎...这个世界干什么都不容易啊，成为人气漫画家的路还很长	...",
	u8"说起来如果在剧情里面加入个女主角的话效果可能会更好一点	儿，不过我基本没有和女生接触过，女主角什么的，说实话完全把握不	好...",
	u8"脑袋里思考着女主角的事情，我已经到了鞋柜前面",
	u8"结城： 这?这个是？信封？",
	u8"我打开自己的鞋柜，和以往不同的是，我在里面发现了一封白	色的信封。",
	u8"这上面的收件人，长谷川一郎...！这是我漫画连载的笔名，这	个信封，难道是...",
	u8"结城： 怎么可能是那种东西嘛，情书什么的，我这种人这么可	能收得到 ? 不会是读者寄过来的刀片吧？",
	u8"结城： 再说知道我作为漫画家的笔名的，在这个学校也就只有	几个关系好的男生而已，这封信应该是他们的恶作剧吧，想看我错认成	情书之后的反响 ? 那帮家伙现在一定就躲在这附近！",
	u8"我摆摆头来回看看四周，发现周围的确没有别人，我又低头看	了看那白色的信封。" ,
	u8"柔软丝滑的纸质，工整的字迹，还确实能闻到女孩子特有的淡	淡的清香。",
	u8"难道真的是女孩子?.不！那种事情怎么可能？！可是无论如何	都要先确认一下信的内容 ? 怎么办，要在这里把信封拆开吗？ ? ? "
};